app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups" WHERE ("groups".user_id = 6) ORDER BY groups.created_at DESC
SELECT "group_members".* FROM "group_members" INNER JOIN "groups" ON "groups"."id" = "group_members"."group_id" WHERE ("group_members".user_id = 6) AND ("group_members"."isInvited" = 't')
---
    def index
        @group          = current_user.groups
        @joinedGroup    = current_user.group_members.joins(:group).where(:isInvited => true)

INSERT INTO "groups" ("created_at", "title", "updated_at", "user_id") VALUES ('2011-03-10 12:50:29.495927', 'Hallo Welt', '2011-03-10 12:50:29.495927', 6)
---
    def create

        @group = current_user.groups.build(params[:group])
        if @group.save