app/controllers/projects_controller.rb

    def index
        @project = @group.projects
        @groupmember = @group.group_members
---
SELECT "group_members".* FROM "group_members" WHERE ("group_members".group_id = 11)